<html>
	<head>
		<title>Clenaups</title>
		<meta name="vs_targetSchema" content="http://schemas.microsoft.com/intellisense/ie5">
		<link rel="stylesheet" type="text/css" href="format.css">
<meta http-equiv="content-type" content="text/html; charset=windows-1250">
	</head>
	<BODY>
		<h2>Kitakar&iacute;t&aacute;s</h2>
		<p>A kijel&ouml;lt elemhez, t&ouml;bbf&eacute;le &nbsp;takar&iacute;t&aacute;si mûveletet alkalmazhat. A takar&iacute;t&aacute;shoz hozz&aacute;f&eacute;rhet a fõ men&uuml;n,&nbsp;az&nbsp;eszk&ouml;zt&aacute;ron&nbsp;&eacute;s&nbsp;gyorsbillentyûk&ouml;n kereszt&uuml;l.
		</p>
		<h3>Kijel&ouml;lt friss&iacute;t&eacute;se</h3>
		<p>Lehet, hogy n&eacute;h&aacute;ny elem t&ouml;rl&eacute;sre, vagy m&oacute;dos&iacute;t&aacute;sra ker&uuml;lt a WinDirStat-on k&iacute;v&uuml;l. A &quot;Friss&iacute;t&eacute;s&quot; 
			v&eacute;grehajt&aacute;s&aacute;val a WinDirStat &uacute;jraolvassa az elemet, hogy a k&eacute;pernyõ&nbsp;&ouml;sszhangban&nbsp;legyen &uacute;jra&nbsp;a&nbsp;merevlemez&nbsp;&aacute;llapot&aacute;val.
		</p>
		<h3>&Uacute;tvonal m&aacute;sol&aacute;sa</h3>
		<p>Kijel&ouml;lt elem &uacute;tvonal&aacute;nak m&aacute;sol&aacute;sa a v&aacute;g&oacute;lapra.</p>
		<h3>Megnyit&aacute;s</h3>
		<p>A kijel&ouml;lt f&aacute;jl megnyit&aacute;sa. Figyelem: abban az esetben, ha ez egy futtathat&oacute; f&aacute;jl (.exe), a program gondolkod&aacute;s n&eacute;lk&uuml;l elindul.
		</p>
		<h3>Int&eacute;zõ most</h3>
		<p>A Windows Int&eacute;zõ elind&iacute;t&aacute;sa, hogy megtekinthesse a kijel&ouml;lt elemet.</p>
		<h3>Parancssor most</h3>
		<p>DOS parancssor megnyit&aacute;sa a kijel&ouml;lt k&ouml;nyvt&aacute;rban.</p>
		<h3>T&ouml;rl&eacute;s (a Lomt&aacute;rba)</h3>
		<p>A kijel&ouml;lt elem &aacute;thelyez&eacute;se a Lomt&aacute;rba. Ekkor az elem &eacute;s a lomt&aacute;r k&ouml;nyvt&aacute;r is friss&iacute;t&eacute;sre ker&uuml;l.</p>
		<h3>T&ouml;rl&eacute;s (nem &aacute;ll&iacute;that&oacute; vissza)</h3>
		<p>A kijel&ouml;lt elem visszaford&iacute;thatatlan t&ouml;rl&eacute;se. Ekkor az elem friss&iacute;t&eacute;sre ker&uuml;l. K&eacute;rem, csak olyan f&aacute;jlokat &eacute;s k&ouml;nyvt&aacute;rakat t&ouml;r&ouml;lj&ouml;n, amelyekrõl tudja, hogy  
			 
			sem a rendszere, sem m&aacute;s alkalmaz&aacute;sa nem ig&eacute;nyli t&ouml;bbet!
		</p>
		<h3>Tulajdons&aacute;gok</h3>
		<p>A kijel&ouml;lt f&aacute;jl 'Tulajdons&aacute;gok' ablak&aacute;nak megnyit&aacute;sa.</p>
		<h3>Lev&eacute;l k&uuml;ld&eacute;se a tulajdonosnak</h3>
		<p>Sz&ouml;veges jelent&eacute;s k&eacute;sz&iacute;t&eacute;se a kijel&ouml;lt k&ouml;nyvt&aacute;rr&oacute;l, amelyet e-mailben elk&uuml;ldhet a tulajdonosnak. Ez lehet h&aacute;l&oacute;zati meghajt&oacute; is, amelyet t&ouml;bb szem&eacute;ly is haszn&aacute;l. A jelent&eacute;s pontosan soronk&eacute;nt tartalmazza a k&eacute;pernyõn kijel&ouml;lt elem alatt l&eacute;võ k&ouml;nyvt&aacute;rak list&aacute;j&aacute;t,  
			 ugyan&uacute;gy &quot;kibontott &aacute;llapotban&quot; &eacute;s ugyanolyan rendez&eacute;si sorrendben.
		</p>
		<h3>Felhaszn&aacute;l&oacute; &aacute;ltal meghat&aacute;rozott takar&iacute;t&aacute;sok</h3>
		<p>Tov&aacute;bbi takar&iacute;t&aacute;si mûveleteket adhat meg ig&eacute;nyei szerint <a href="userdefinedcleanups.htm">
				adja meg a saj&aacute;t takar&iacute;t&aacute;sait</a>.
		</p>
	</BODY>
</html>
