<html>
	<head>
		<title>Configuration</title>
		<meta name="vs_targetSchema" content="http://schemas.microsoft.com/intellisense/ie5">
		<link rel="stylesheet" type="text/css" href="format.css">
<meta http-equiv="content-type" content="text/html; charset=windows-1250">
	</head>
	<BODY>
		<h2>Be&aacute;ll&iacute;t&aacute;s</h2>
		<h3>&Aacute;ltal&aacute;nos</h3>
		<p><u>Keresztf&aacute;jlrendszer csatol&aacute;sok (csak NT &eacute;s &uacute;jabb)</u>. NTFS alatti k&ouml;teteket kapcsolhat be a k&ouml;nyvt&aacute;rakba. A WinDirStat alap&eacute;rtelmez&eacute;s szerint le&aacute;ll&iacute;tja az ilyen csatol&aacute;si pontok beolvas&aacute;s&aacute;t, &iacute;gy csak egy f&aacute;jlrendszer haszn&aacute;lat&aacute;t mutatja meg. Itt &Ouml;n m&oacute;dos&iacute;thatja ezt a tulajdons&aacute;got. (A felismert UNC meghajt&oacute;kat nem csatolja be.)
		</p>
		<p><u>K&ouml;vetkezõ csatol&aacute;si pontok (kiv&eacute;ve a k&ouml;tet csatol&aacute;si pontokat) (csak NT &eacute;s &uacute;jabb)</u>.
			NTFS alatt l&eacute;võ mapp&aacute;kat, k&eacute;pes &ouml;sszekapcsolni m&aacute;s csatol&aacute;si pontok alatt haszn&aacute;lt mapp&aacute;kkal.
			(Ehhez &Ouml;nnek sz&uuml;ks&eacute;ge lesz egy harmadik f&eacute;l eszk&ouml;z&eacute;sre, pl. az awxlink-re, let&ouml;ltheti innen:  
			<a href="http://www.arniworld.de/" target="_blank">http://www.arniworld.de/</a>, csatol&aacute;si pont l&eacute;trehoz&aacute;s&aacute;hoz.)
			Alap&eacute;rtelmez&eacute;s szerint a WinDirStat le&aacute;ll&iacute;tja az ilyen csatol&aacute;si&nbsp;pontok&nbsp;beolvas&aacute;s&aacute;t. Itt&nbsp;&Ouml;n&nbsp;megv&aacute;ltoztathatja&nbsp;ezt&nbsp;a&nbsp;jellemzõt.
		</p>
		<p><u>Lista&nbsp;st&iacute;lus</u>. Ezzel az opci&oacute;val sorokat &eacute;s r&aacute;csoz&aacute;st alkalmazhat a WinDirStat list&aacute;iban.
		</p>
		<p><u>Nyelv</u>. Be&eacute;p&iacute;tett kieg&eacute;sz&iacute;tõ nyelv az Angol, a leg&ouml;rd&uuml;lõ list&aacute;ban tal&aacute;lja azokat a nyelveket, amelyekhez a kapcsol&oacute;d&oacute;  
			wdsrxxxx.dll l&eacute;tezik. A m&oacute;dos&iacute;t&aacute;sok &eacute;rv&eacute;nyes&iacute;t&eacute;s&eacute;hez &uacute;jra ind&iacute;tania a  
			WinDirStat-ot.</p>
		<h3>K&ouml;nyvt&aacute;r lista</h3>
		<p>K&eacute;t opci&oacute;, amellyel kezelheti, hogy az 'Alszerkezet sz&aacute;zal&eacute;k' &eacute;s 'Sz&aacute;zal&eacute;k' oszlopok k&ouml;t&uuml;l melyik jelenjen meg a vizsg&aacute;lat alatt a k&eacute;pernyõn. A sz&iacute;nekkel az alszerkezet sz&aacute;zal&eacute;kar&aacute;nya ker&uuml;l bemutat&aacute;sra.
		</p>
		<h3>T&eacute;rk&eacute;pfa</h3>
		<p>Param&eacute;terek a n&eacute;gysz&ouml;gletes st&iacute;lus, a p&aacute;rn&aacute;z&aacute;s &aacute;rny&eacute;kol&aacute;sa, a r&aacute;csvonalak &eacute;s a kijel&ouml;l&eacute;s sz&iacute;neinek be&aacute;ll&iacute;t&aacute;s&aacute;hoz.
		</p>
		<h3>Kitakar&iacute;t&aacute;s</h3>
		<p>Itt be&aacute;ll&iacute;thatja a <a href="userdefinedcleanups.htm">Felhaszn&aacute;l&oacute;i takar&iacute;t&aacute;sok</a> jellemzõit.
		</p>
		<h3>Jelent&eacute;s</h3>
		<p>Az adminisztr&aacute;torok itt testreszabhatj&aacute;k az e-mail jelent&eacute;s tulajdons&aacute;gait.</p>
	</BODY>
</html>
