<html>
	<head>
		<title>Coupling of the Views</title>
		<meta name="vs_targetSchema" content="http://schemas.microsoft.com/intellisense/ie5">
		<link rel="stylesheet" type="text/css" href="format.css">
<meta http-equiv="content-type" content="text/html; charset=windows-1250">
	</head>
	<BODY>
		<h2>Megjelen&iacute;t&eacute;sek kapcsol&oacute;d&aacute;sa</h2>
		<p>Ez egy val&oacute;ban erõs pont a WinDirStat-ban, hogy a faszerkezet n&eacute;zete, a K&ouml;nyvt&aacute;r lista, 
			a Kiterjeszt&eacute;sek list&aacute;ja &eacute;s a T&eacute;rk&eacute;pfa, hogyan kapcsol&oacute;dik egym&aacute;shoz.
		</p>
		<h3>K&ouml;nyvt&aacute;r lista -&gt; T&eacute;rk&eacute;pfa</h3>
		<p>Amikor &Ouml;n <i>kijel&ouml;l</i> egy elemet  (k&ouml;nyvt&aacute;rat, vagy f&aacute;jlt) a k&ouml;nyvt&aacute;rlist&aacute;ban, a t&eacute;rk&eacute;pf&aacute;ban szint&eacute;n kiemelt kerettel jelenik meg ez az elem. Ezzel a speci&aacute;lis tulajdons&aacute;ggal  
			&Ouml;n &aacute;ttekintheti a k&ouml;nyvt&aacute;rak, vagy f&aacute;jlok m&eacute;ret&eacute;t.
		</p>
		<h3>T&eacute;rk&eacute;pfa -&gt; K&ouml;nyvt&aacute;r lista</h3>
		<p>Amikor &Ouml;n r&aacute;kattint a t&eacute;rk&eacute;pf&aacute;ra az eg&eacute;rrel, mindig egy &aacute;llom&aacute;nyt tal&aacute;l (sz&iacute;nezett t&eacute;glalap). Ezut&aacute;n, amikor kinyitja a k&ouml;nyvt&aacute;r list&aacute;t (ha sz&uuml;ks&eacute;ges) megl&aacute;thatja a kijel&ouml;lt &aacute;llom&aacute;ny  
			kapcsol&oacute;d&aacute;sait. &Iacute;gy &Ouml;n k&eacute;pes, pl. egy kattint&aacute;ssal egy nagy t&eacute;glalapon,&nbsp;megtekinteni az &aacute;llom&aacute;ny &uacute;tvonal&aacute;t &eacute;s atrrib&uacute;tumait a k&ouml;nyvt&aacute;rlist&aacute;ban.
		</p>
		<p>Mivel ezek kapcsolatban vannak egym&aacute;ssal, a k&ouml;nyvt&aacute;r lista &eacute;s a t&eacute;rk&eacute;pfa mindig szinkronban van egym&aacute;ssal.
		</p>
		<h3>K&ouml;nyvt&aacute;r lista + T&eacute;rk&eacute;pfa -&gt; Kiterjeszt&eacute;s lista</h3>
		<p>Amikor kijel&ouml;l egy <i>f&aacute;jlt</i> a k&ouml;nyvt&aacute;rlist&aacute;ban  (vagy a t&eacute;rk&eacute;pf&aacute;ban), a f&aacute;jl t&iacute;pusa megjelenik a kiterjeszt&eacute;s list&aacute;ban. A kijel&ouml;lt kiterjeszt&eacute;st g&ouml;rgetheti&nbsp;is ebben a n&eacute;zetben. &Iacute;gy &Ouml;n megtekintheti a le&iacute;r&aacute;s&aacute;t &eacute;s a statisztik&aacute;j&aacute;t az ilyen t&iacute;pus&uacute; f&aacute;jloknak.
		</p>
		<h3>Kiterjeszt&eacute;s lista -&gt; T&eacute;rk&eacute;pfa</h3>
		<p>Amikor kijel&ouml;l egy f&aacute;jlt&iacute;pust a kiterjeszt&eacute;sek list&aacute;j&aacute;ban, a t&eacute;rk&eacute;pf&aacute;ban minden ilyen t&iacute;pus&uacute; f&aacute;jl kijel&ouml;l&eacute;sre ker&uuml;l.</p>
	</BODY>
</html>
