<html>
	<head>
		<title>Directory List</title>
		<meta name="vs_targetSchema" content="http://schemas.microsoft.com/intellisense/ie5">
		<link rel="stylesheet" type="text/css" href="format.css">
<meta http-equiv="content-type" content="text/html; charset=windows-1250">
	</head>
	<BODY>
		<h2>K&ouml;nyvt&aacute;r lista</h2>
		<p>A k&ouml;nyvt&aacute;rlista hasonl&iacute;t a Windows Explorer faszerkezet&eacute;re, azzal a k&uuml;l&ouml;nbs&eacute;ggel, hogy a k&ouml;nyvt&aacute;rak &eacute;s a f&aacute;jlok m&eacute;ret szerint cs&ouml;kkenõ sorrendben jelennek meg.  
			Fel&uuml;l l&aacute;thatja azokat&nbsp;a k&ouml;nyvt&aacute;rakat &eacute;s a f&aacute;jlokat,&nbsp;amelyek&nbsp;a&nbsp;legnagyobb&nbsp;ter&uuml;letet&nbsp;haszn&aacute;lj&aacute;k. Amikor kinyit egy k&ouml;nyvt&aacute;rat, az alk&ouml;nyvt&aacute;rak is a fentiek alapj&aacute;n m&eacute;ret&uuml;k szerint jelennek meg.
		</p>
		<h3>Oszlopok</h3>
		<p>
			<ul>
				<li>
					<u>N&eacute;v</u>. Ebben az oszlopban jelenik meg a k&ouml;nyvt&aacute;rak &eacute;s f&aacute;jlok neve &eacute;s azok faszerkezete.</li>
				<li>
					<u>M&eacute;ret</u>. F&aacute;jlok eset&eacute;n a f&aacute;jl m&eacute;rete b&aacute;jtban jelenik meg. K&ouml;nyvt&aacute;rak eset&eacute;n&nbsp;ez&nbsp;a&nbsp;m&eacute;ret&nbsp;tartalmazza minden&nbsp;alk&ouml;nyvt&aacute;r&nbsp;&eacute;s&nbsp;f&aacute;jl&nbsp;m&eacute;ret&eacute;t.</li>
				<li>
					<u>R&eacute;szfa sz&aacute;zal&eacute;k</u>. Ebben az oszlopban l&aacute;thatja,&nbsp;hogy&nbsp;az&nbsp;adott&nbsp;&aacute;llom&aacute;ny&nbsp;&eacute;s annak elemei mekkora helyet foglalnak el az adathordoz&oacute;n.  
					Ez az inform&aacute;ci&oacute; &ouml;sszehasonl&iacute;t&oacute; jellegû csak az <i>egy&nbsp;</i><span style="font-family:'Palatino Linotype','Times New Roman',Times,serif; margin-bottom:0.5cm;">szinten&nbsp;&eacute;s&nbsp;mindig</span> kapcsolatban&nbsp;l&eacute;võ&nbsp;sz&uuml;lõ&nbsp;elemeken&nbsp;bel&uuml;l&nbsp;&eacute;rv&eacute;nyes.<br>
					[A vizsg&aacute;lat alatt, ebben az oszlopban megjelen&iacute;thet egy&nbsp;&quot;pacman&quot;&nbsp;figur&aacute;t,&nbsp;vagy&nbsp;a&nbsp;beolvasott&nbsp; &aacute;llom&aacute;nyok&nbsp;sz&aacute;m&aacute;t.]
				</li>
				<li>
					<u>Sz&aacute;zal&eacute;k</u>. A &quot;R&eacute;szfa sz&aacute;zal&eacute;k&quot; oszlopban megjelen&iacute;tett inform&aacute;ci&oacute;k mutat&aacute;sa sz&aacute;zal&eacute;kban.<br>
					[A vizsg&aacute;lat alatt, ebben az oszlopban opcion&aacute;lisan  
					megjelen&iacute;theti az eltelt idõt.]
				</li>
				<li>
					<u>F&aacute;jlok</u>. F&aacute;jlok sz&aacute;ma a r&eacute;szf&aacute;ban.</li>
				<li>
					<u>Alk&ouml;nyvt&aacute;rak</u>. Alk&ouml;nyvt&aacute;rak sz&aacute;ma a r&eacute;szf&aacute;ban.</li>
				<li>
					<u>Elemek</u>. Elemek sz&aacute;ma a r&eacute;szf&aacute;ban. A &quot;F&aacute;jlok&quot; &eacute;s &quot;Alk&ouml;nyvt&aacute;rak&quot; &ouml;sszege.</li>
				<li>
					<u>Ut&oacute;lj&aacute;ra m&oacute;dos&iacute;tva</u>. A r&eacute;szfa m&oacute;dos&iacute;t&aacute;s&aacute;nak ut&oacute;ls&oacute; d&aacute;tuma.</li>
				<li>
					<u>Attrib&uacute;tumok</u>. F&aacute;jl/mappa attrib&uacute;tumok. R = &iacute;r&aacute;sv&eacute;dett, H = rejtett, S = rendszer,
					A = arch&iacute;v, C = t&ouml;m&ouml;r&iacute;tett, E = titkos&iacute;tott.</li>
			</ul>
		</p>
		<h3>Mûveletek</h3>
		<p>A &quot;N&eacute;v&quot; oszlopban &Ouml;n k&eacute;pes az egere kattint&aacute;s&aacute;val kinyitni &eacute;s &ouml;sszez&aacute;rni a k&ouml;nyvt&aacute;rakat.  
			Kattintson a n&eacute;gyzetekben l&eacute;võ + &eacute;s - jelre, &uacute;gy mint a Windows Explorer-ben. Ha egy n&eacute;vre kattint, azzal <i>kijel&ouml;li</i> az  
			 elemet. Ezut&aacute;n k&ouml;nnyed&eacute;n navig&aacute;lhat a faszerkezetben a ny&iacute;l billentyûkkel.
		</p>
		<p>A t&eacute;rk&eacute;pf&aacute;ban a kijel&ouml;lt elem, mindig kiemelt keretben jelenik meg.
		</p>
		<p>Ha kijel&ouml;l egy f&aacute;jlt, a kiterjeszt&eacute;s list&aacute;ban automatikusan megjelenik, annak a t&iacute;pusa.
		</p>
		<p>A <a href="sorting.htm">rendez&eacute;st</a> be&aacute;ll&iacute;thatja az oszlop fejl&eacute;c&eacute;re t&ouml;rt&eacute;nõ eg&eacute;rkattint&aacute;ssal.
		</p>
	</BODY>
</html>
