<html>
	<head>
		<title>Legend</title>
		<meta name="vs_targetSchema" content="http://schemas.microsoft.com/intellisense/ie5">
		<link rel="stylesheet" type="text/css" href="format.css">
		<style type="text/css">
		<!--
			h3 { margin-bottom:6pt; }
			p { margin-top:0pt; }
		-->
		</style>
<meta http-equiv="content-type" content="text/html; charset=windows-1250">
	</head>
	<BODY>
		<h2>Jelmagyar&aacute;zat</h2>
		<h3>&lt;F&aacute;jl&gt;</h3>
		<p>&Aacute;ltal&aacute;ban a k&ouml;nyvt&aacute;rlista minden egyes k&ouml;nyvt&aacute;r&aacute;ban tal&aacute;lhat&oacute; egy l&aacute;tsz&oacute;lagos alk&ouml;nyvt&aacute;r 
		&lt;F&aacute;jl&gt;. Oda, minden a k&ouml;nyvt&aacute;rban l&eacute;võ szok&aacute;sos f&aacute;jl &ouml;sszerak&aacute;sra ker&uuml;l. Azaz minden olyan f&aacute;jl, amely k&ouml;zvetlen lesz&aacute;rmazottja a k&ouml;nyvt&aacute;rnak &eacute;s nem alk&ouml;nyvt&aacute;rakban helyezkedik el. 
		Ez hasznos lehet, amikor a k&ouml;nyvt&aacute;r list&aacute;t takar&iacute;tja.&nbsp;Ezzel az elemmel megtekintheti, hogy mekkora ter&uuml;letet haszn&aacute;l &ouml;sszesen a k&ouml;nyvt&aacute;rban 
		(nem az alk&ouml;nyvt&aacute;rakban).
		</p>
		<p>A &lt;F&aacute;jl&gt; elem elhagyhat&oacute;, ha csak egy f&aacute;jl van a k&ouml;nyvt&aacute;rban, vagy ha nincsenek alk&ouml;nyvt&aacute;rak.
		</p>
		<h3>&lt;Szabad ter&uuml;let&gt;</h3>
		<p>Ha aktiv&aacute;lja a &quot;Szabad ter&uuml;let kijelz&eacute;se&quot; lehetõs&eacute;get a Be&aacute;ll&iacute;t&aacute;sok men&uuml;ben, minden meghajt&oacute;n megjelenik a&nbsp;&lt;Szabad&nbsp;ter&uuml;let&gt; elem. Az elem m&eacute;rete megegyezik a meghajt&oacute;n rendelkez&eacute;sre &aacute;ll&oacute; szabad ter&uuml;let m&eacute;ret&eacute;vel. 
		Ez az elem a t&eacute;rk&eacute;pf&aacute;ban s&ouml;t&eacute;tsz&uuml;rke sz&iacute;nû.  
		A &lt;Szabad ter&uuml;let&gt; elem h&iacute;ven t&uuml;kr&ouml;zi a teljes haszn&aacute;lt lemezter&uuml;let &eacute;s a szabad lemezter&uuml;let ar&aacute;ny&aacute;t. 
		Ez az inform&aacute;ci&oacute; megfelel a Windows Int&eacute;zõ tulajdons&aacute;gok p&aacute;rbesz&eacute;dablak&aacute;ban megjelenõ &eacute;rt&eacute;keknek.
		</p>
		<h3>&lt;Ismeretlen&gt;</h3>
		<p>Ha aktiv&aacute;lja a Be&aacute;ll&iacute;t&aacute;sok men&uuml;ben az &quot;Ismeretlen megjelen&iacute;t&eacute;se&quot; opci&oacute;t, minden meghajt&oacute;n lesz egy 
		&lt;Ismeretlen&gt; elem. Ez egy l&eacute;nyeges dolog a k&ouml;vetkezõk szerint. 
		Egyr&eacute;szt a WinDirStat tudja, hogy mekkora a lemez teljes kapacit&aacute;sa &eacute;s a szabad ter&uuml;let nagys&aacute;ga. 
		(Ezek a megjelenõ &eacute;rt&eacute;kek megyegyeznek a Windows Int&eacute;zõ lemeztulajdons&aacute;gok p&aacute;rbesz&eacute;dabalak&aacute;ban l&aacute;that&oacute; &eacute;rt&eacute;kekkel.)
		M&aacute;sr&eacute;szt a WinDirStat k&eacute;pes meghat&aacute;rozni az &ouml;sszes elem &eacute;s f&aacute;jl m&eacute;ret&eacute;t. 
		
		Nos az &lt;Ismeretlen&gt; ebben k&uuml;l&ouml;nb&ouml;zik: A teljes kapacit&aacute;sb&oacute;l kivonva a szabad ter&uuml;let nagys&aacute;ga, ebbõl kivonva a meghat&aacute;rozott &ouml;sszeg. 
		A marad&eacute;k nagyobb mint nulla. 
		Elõfordulhat a meghajt&oacute;n olyan ter&uuml;let (pl. &quot;System Volume&nbsp;Information&quot;),&nbsp;amely&nbsp;olvas&aacute;s&nbsp;&eacute;s&nbsp;hozz&eacute;f&eacute;r&eacute;s&nbsp;ellen v&eacute;dve van. 
		Ennek a m&eacute;ret&eacute;t a WinDirStat nem k&eacute;pes meghat&aacute;rozni &eacute;s belesz&aacute;molni a haszn&aacute;lt ter&uuml;let m&eacute;ret&eacute;be.
		A t&eacute;rk&eacute;pf&aacute;ban az &lt;Ismeretlen&gt; jelz&eacute;sû elem vil&aacute;gos s&aacute;rg&aacute;val sz&iacute;nezve.
		</p>
		<h3>&lt; (az oszlopok fejl&eacute;c&eacute;ben)</h3>
		<p>a jelzõ a lista <a href="sorting.htm">rendezetts&eacute;g&eacute;re</a> utal az oszlop fejl&eacute;c&eacute;ben - n&ouml;vekvõ sorrend.
		</p>
		<h3>&gt; (az oszlopok fejl&eacute;c&eacute;ben)</h3>
		<p>a jelzõ a lista <a href="sorting.htm">rendezetts&eacute;g&eacute;re</a> utal az oszlop fejl&eacute;c&eacute;ben - cs&ouml;kkenõ sorrend.
		</p>
	</BODY>
</html>
