<html>
	<head>
		<title>Treemap</title>
		<meta name="vs_targetSchema" content="http://schemas.microsoft.com/intellisense/ie5">
		<link rel="stylesheet" type="text/css" href="format.css">
<meta http-equiv="content-type" content="text/html; charset=windows-1250">
	</head>
	<BODY>
		<h2>T&eacute;rk&eacute;pfa</h2>
		<p>A t&eacute;rk&eacute;pfa megjelen&iacute;ti&nbsp;a&nbsp;teljes <a href="whatisatree.htm">k&ouml;nyvt&aacute;r faszerkezetet</a>
			&eacute;s tartalm&aacute;t.
		</p>
		<p>Itt egy f&aacute;jl egy sz&iacute;nes t&eacute;glalappal ker&uuml;l jel&ouml;l&eacute;sre, a ter&uuml;lete ar&aacute;nyos a f&aacute;jl m&eacute;ret&eacute;vel.
		</p>
		A t&eacute;glalapok &uacute;gy vannak elrendezve, hogy azok &uacute;jra t&eacute;glalapokkal vannak kib&eacute;lelve, melyek tartalmazz&aacute;k az &ouml;sszes f&aacute;jlt &eacute;s alk&ouml;nyvt&aacute;rat.  
		&Iacute;gy a ter&uuml;letek ar&aacute;nyosak az alszerkezetek m&eacute;reteivel. 
 </p>
		<p>A t&eacute;glalapok sz&iacute;nez&eacute;se jelzi a f&aacute;jl t&iacute;pus&aacute;t, melyet megtekinthet a kiterjeszt&eacute;sek list&aacute;j&aacute;ban.
		</p>
		<p>A kip&aacute;rn&aacute;z&aacute;s &aacute;rny&eacute;kol&aacute;sa, kieg&eacute;sz&iacute;tõ megjelen&iacute;t&eacute;se a k&ouml;nyvt&aacute;rszerkezetnek.</p>
		<h3>Mûveletek</h3>
		<p>&Ouml;n k&ouml;nnyed&eacute;n megtekintheti a nagy t&eacute;glalapokat, &iacute;gy ezen kereszt&uuml;l a nagy &aacute;llom&aacute;nyokat, m&eacute;g ha azok m&eacute;lyen is vannak elrejtve egy alk&ouml;nyvt&aacute;rban a k&ouml;nyvt&aacute;rszerkezeten bel&uuml;l.  
			Kattintson egy elemre: a k&ouml;nyvt&aacute;r list&aacute;ban megny&iacute;lik a f&aacute;jl &uacute;tvonala &eacute;s  
			elolvashatja a hely&eacute;t &eacute;s az atrrib&uacute;tumait, &eacute;s  
			- felt&eacute;ve ha szeretn&eacute; - v&eacute;grehajthat egy takar&iacute;t&aacute;si mûveletet, pl. t&ouml;r&ouml;lheti a f&aacute;jlt.
		</p>
		<p>Navig&aacute;lhat a k&ouml;nyvt&aacute;r list&aacute;ban: a megfelelõ kijel&ouml;l&eacute;shez a keret m&aacute;s sz&iacute;nnel ker&uuml;l kiemel&eacute;sre. &Iacute;gy megl&aacute;thatja az ar&aacute;nyokat: Milyen nagy  
			p&eacute;ld&aacute;ul a C:\windows k&ouml;nyvt&aacute;r, &ouml;sszevetve a C:\program files k&ouml;nyvt&aacute;rral?
		</p>
		<p>A k&ouml;rnyezeti men&uuml; opci&oacute;i a &quot;Sz&uuml;lõ kijel&ouml;l&eacute;se&quot; &eacute;s a &quot;Gyermek &uacute;jrajel&ouml;l&eacute;se&quot; seg&iacute;tik a navig&aacute;ci&oacute;t.
		</p>
		<p>Nagy&iacute;t&aacute;s. A &quot;Nagy&iacute;t&aacute;s&quot; opci&oacute;val felnagy&iacute;thatja a t&eacute;rk&eacute;pf&aacute;t, &uacute;gy hogy az alszerkezetek is teljes m&eacute;retben jelennek meg.  
			A gy&ouml;k&eacute;ren bel&uuml;li k&ouml;nyvt&aacute;r lista &eacute;s alszerkezetek k&eacute;k kerettel jelennek meg.  
			 
			A &quot;Kicsiny&iacute;t&eacute;s&quot; opci&oacute;val &Ouml;n egy l&eacute;p&eacute;ssel visszal&eacute;phet &eacute;s a sz&uuml;lõ elemet l&aacute;thatja &uacute;jra.
		</p>
	</BODY>
</html>
