<html>
	<head>
		<title>User Defined Cleanups</title>
		<meta name="vs_targetSchema" content="http://schemas.microsoft.com/intellisense/ie5">
		<link rel="stylesheet" type="text/css" href="format.css">
<meta http-equiv="content-type" content="text/html; charset=windows-1250">
	</head>
	<BODY>
		<h2>Felhaszn&aacute;l&oacute; &aacute;ltal megadott takar&iacute;t&aacute;sok</h2>
		<p><i>Halad&oacute; felhaszn&aacute;l&oacute;k r&eacute;sz&eacute;re.</i></p>
		<p>&Ouml;n megadhat 10 egy&eacute;ni takar&iacute;t&aacute;si mûveletet. Ezek a takar&iacute;t&aacute;sok a <i>parancssorban  
				</i>ker&uuml;lnek megad&aacute;sra.
		</p>
		<p>V&aacute;lasszon ki egy bejegyz&eacute;st a list&aacute;b&oacute;l &eacute;s &quot;enged&eacute;lyezze&quot; azt. V&aacute;lasszon egy nevet, amely a men&uuml;ben fog megjelenni.
		</p>
		<p>&Aacute;ll&iacute;tsa &ouml;ssze a parancssort. Haszn&aacute;lja az &quot;MSDOS parancssort&quot; (Windows 9x, command.com),&nbsp;vagy&nbsp;a&nbsp;&quot;Parancssor&quot;-t (NT, cmd.exe) ahol seg&iacute;ts&eacute;get kaphat a rendelkez&eacute;sre &aacute;ll&oacute; parancsokhoz, &eacute;s tesztelheti azokat.
		</p>
		<h3>P&eacute;ld&aacute;k</h3>
		<p>
			<ul>
				<li>
					<pre>dir /b &gt; dir.txt</pre>
					F&aacute;jlnevek kilist&aacute;z&aacute;sa a dir.txt sz&ouml;vegf&aacute;jlba.</li>
				<li>
					<pre>del *.bak</pre>
					&Ouml;sszes *.bak f&aacute;jl t&ouml;rl&eacute;se az aktu&aacute;lis k&ouml;nyvt&aacute;rban.</li>
				<li>
					<pre>del /s *.bak *.tmp</pre>
					Rekurz&iacute;van t&ouml;rli az &ouml;sszes *.bak &eacute;s *.tmp f&aacute;jlt.</li>
				<li>
					<pre>windirstat.exe &quot;%p&quot;</pre>
					A WinDirStat m&aacute;sodik p&eacute;ld&aacute;ny&aacute;nak megh&iacute;v&aacute;sa,&nbsp;amely&nbsp;tartalmazza&nbsp;a&nbsp;kijel&ouml;lt&nbsp;k&ouml;nyvt&aacute;r&nbsp;&uacute;tvonal&aacute;t&nbsp;(egy &Uacute;TVONALAT (PATH) a windirstat.exe-hez&nbsp;be&nbsp;kell&nbsp;&aacute;ll&iacute;tania).</li>
			</ul>
		</p>
		<h3>P&eacute;ld&aacute;k (NT &eacute;s magasabb)</h3>
		<p>
			<ul>
				<li>
					<pre>echo %n &amp; pause</pre>
					Az aktu&aacute;lis k&ouml;nyvt&aacute;r nev&eacute;nek megjelen&iacute;t&eacute;se.</li>
				<li>
					<pre>cd &amp; pause</pre>
					Az aktu&aacute;lis &uacute;tvonal megjelen&iacute;t&eacute;se &eacute;s v&aacute;rakoz&aacute;s egy billentyû le&uuml;t&eacute;sre.</li>
				<li>
					<pre>cd .. &amp;&amp; myzip &quot;%n&quot;</pre>
					Kijel&ouml;lt k&ouml;nyvt&aacute;r t&ouml;m&ouml;r&iacute;t&eacute;se (felt&eacute;telezve, hogy a t&ouml;m&ouml;r&iacute;tõ eszk&ouml;ze a myzip).</li>
			</ul>
		</p>
		<p>A kifejez&eacute;sekben haszn&aacute;lhatja a %p, %n, %sp, %sn helyettes&iacute;tõ karaktereket. Ne felejtse el, hogy azokat id&eacute;zõjelek k&ouml;z&ouml;tt kell haszn&aacute;lnia.</p>
		<h3>Assembly parancssorban</h3>
		<p>Felt&eacute;telezve ha megadta a parancssort
			<pre>xyz</pre>
			. amikor a WinDirStat megpr&oacute;b&aacute;lja elkezdeni a k&ouml;vetkezõ folyamatot:
			<pre>%COMSPEC% /c xyz</pre>
		</p>
		<h3>Tov&aacute;bbi lehetõs&eacute;gek</h3>
		<p>Megadhatja, hogy milyen elemt&iacute;pusok legyenek t&ouml;r&ouml;lve. Legyen &oacute;vatos az UNC &uacute;tvonalakkal: a 
			chdir parancs nem mûk&ouml;dik az UNC &uacute;tvonalakn&aacute;l!</p>
		<p>Megadhatja, hogy melyik takar&iacute;t&aacute;s ker&uuml;lj&ouml;n v&eacute;grehajt&aacute;sra rekurz&iacute;van minden alk&ouml;nyvt&aacute;rban  
			(elsõ m&eacute;lys&eacute;g).</p>
		<p>M&aacute;s opci&oacute;kat is alkalmazhat a takar&iacute;t&aacute;shoz.</p>
	</BODY>
</html>
