<html>
	<head>
		<title>What is a Directory Tree?</title>
		<meta content="http://schemas.microsoft.com/intellisense/ie5" name="vs_targetSchema">
		<LINK href="format.css" type="text/css" rel="stylesheet">
<meta http-equiv="content-type" content="text/html; charset=windows-1250">
	</head>
	<BODY>
		<h2>Mi is van egy k&ouml;nyvt&aacute;rszerkezetben?</h2>
		<p>A legt&ouml;bb oper&aacute;ci&oacute;s rendszer, &iacute;gy a Microsoft Windows is, az adatokat a merevlemezen hierarchikus rendben t&aacute;rolja.
		</p>
		<p>Egyr&eacute;szt ott vannak a <i>f&aacute;jlok,&nbsp;</i>amelyek t&eacute;nyleges adattartalommal &eacute;s m&eacute;rettel rendelkeznek.  
			Minden f&aacute;jl rendelkezik egy n&eacute;vvel. A Microsoft Windows alatt a &quot;f&aacute;jln&eacute;v kiterjeszt&eacute;se&quot; inform&aacute;ci&oacute;kat ad a f&aacute;jl t&iacute;pus&aacute;r&oacute;l. Az &quot;.exe&quot; kiterjeszt&eacute;s p&eacute;ld&aacute;ul, egy programf&aacute;jlt jelez.  
			A &quot;.doc&quot; kiterjeszt&eacute;s egy  
			WinWord&nbsp;dokumentumra utal,&nbsp;a&nbsp;&quot;.jpg&quot; kiterjeszt&eacute;s egy k&eacute;p&aacute;llom&aacute;ny, &eacute;s &iacute;gy tov&aacute;bb. De nevets&eacute;gesen, a Microsoft 
			Windows Int&eacute;zõ a f&aacute;jlnevek kiterjeszt&eacute;seit alap&eacute;rtelmez&eacute;sben elrejti. &Ouml;n m&oacute;dos&iacute;thatja ezt a jellemzõt a Windows Int&eacute;zõ be&aacute;ll&iacute;t&aacute;sok men&uuml;j&eacute;ben.
		</p>
		<p>M&aacute;sr&eacute;szt ott vannak a <i>k&ouml;nyvt&aacute;rak</i>. A Windows Int&eacute;zõ &eacute;s a WinDirStat, a k&ouml;nyvt&aacute;rakat s&aacute;rga mapp&aacute;kkal szimboliz&aacute;lja. A k&ouml;nyvt&aacute;rak is rendelkeznek n&eacute;vvel, de norm&aacute;l esetben kiterjeszt&eacute;s n&eacute;lk&uuml;l szerepelnek. A 
			&nbsp;k&ouml;nyvt&aacute;rak&nbsp;csak&nbsp;f&aacute;jlokat&nbsp;&eacute;s&nbsp;m&aacute;s&nbsp;egy&eacute;b&nbsp;k&ouml;nyvt&aacute;rakat&nbsp;(&quot;alk&ouml;nyvt&aacute;rak&quot;) tartalmaznak. Annak k&ouml;sz&ouml;nhetõen, hogy a k&ouml;nyvt&aacute;rak tartalmazhatnak alk&ouml;nyvt&aacute;rakat &eacute;s azok &uacute;jra tartalmazhatnak alk&ouml;nyvt&aacute;rakat, ez eredm&eacute;nyezi a lemez hierarchikus szerkezet&eacute;t. 
			 
			
		</p>
		<p>
			<img src="tree.jpg" width="99" height="105" align="left" vspace="20" hspace="20" />
			A &quot;hierarchikus szerkezet&quot; helyett egyszerûen mondjuk csak, hogy <i>faszerkezet</i>. Egy fa is hierarchikusan &eacute;p&uuml;l fel: A t&ouml;rzs el&aacute;gazik &aacute;gakba, az &aacute;gak &uacute;jabb &aacute;gakba &eacute;s azok al-&aacute;gakba &aacute;gaznak el, m&iacute;g eljutunk a legals&oacute; szintig a levelekig.  
			A f&aacute;jlrendszer un. gy&ouml;k&eacute;rk&ouml;nyvt&aacute;r rendszert alkot, innen &aacute;gaznak el az alk&ouml;nyvt&aacute;rak &eacute;s a f&aacute;jlok.
		</p>
		<p>
			Ez&eacute;rt h&iacute;vjuk a sz&aacute;m&iacute;t&oacute;g&eacute;p f&aacute;jlrendszer&eacute;t egyszerûen &quot;faszerkezetnek&quot;.
		</p>
		<p><br clear="all" />
			A val&oacute;s&aacute;gos faszerkezettõl elt&eacute;rõen, a lemezen a t&ouml;rzs&ouml;n &eacute;s az el&aacute;gaz&aacute;sokon is lehetnek al elemek.  
			&Eacute;s a legval&oacute;s&aacute;gosabb faszerkezettõl elt&eacute;rõen: a <u>f&aacute;jlok</u> terjedelmes tulajdons&aacute;gokkal rendelkeznek  
			(m&eacute;rettel, amelyet megab&aacute;jt-al, vagy gigab&aacute;jt-al jel&ouml;l&uuml;nk), add&iacute;g a k&ouml;nyvt&aacute;rak elhanyagolhat&oacute; m&eacute;rettel rendelkeznek. Egy&eacute;bk&eacute;nt&nbsp;elvonatkoztathatunk a faszerkezet k&eacute;p&eacute;tõl: a gy&ouml;k&eacute;r lehet fel&uuml;l &eacute;s a levelek (f&aacute;jlok) alul.
		</p>
		<p>Ha &Ouml;n megn&eacute;z egy el&aacute;gaz&aacute;st a f&aacute;ban &eacute;s azt belesz&uacute;rja a f&ouml;ldbe, akkor abb&oacute;l egy kisebb fa lesz:&nbsp; 
			Minden el&aacute;gaz&aacute;s folytat&oacute;dhat egy al-el&aacute;gaz&aacute;sban &eacute;s  
			&aacute;llom&aacute;nyokban, ez a faszerkezet az <i>al-faszerkezet</i>.
		</p>
		<p>A csal&aacute;dfa hasonlatot szint&eacute;n gyakran haszn&aacute;ljuk: A k&ouml;nyvt&aacute;r alk&ouml;nyvt&aacute;rai &eacute;s f&aacute;jljai a <i>gyermekek.</i>  
			&Eacute;s az alk&ouml;nyvt&aacute;rakat, vagy f&aacute;jlokat tartalmaz&oacute; k&ouml;nyvt&aacute;r a <i>sz&uuml;lõ </i>k&ouml;nyvt&aacute;r.  
			A gy&ouml;k&eacute;rk&ouml;nyvt&aacute;r a legelsõ elõdje a k&ouml;nyvt&aacute;rszerkezetben l&eacute;võ &ouml;sszes elemnek.
		</p>
		<p>Az <i>&uacute;tvonalban</i> &quot;C:\documents\letters\draft\loveletter.doc&quot; jel&ouml;l&eacute;sre ker&uuml;l a merevlemez  
			C:, a gy&ouml;k&eacute;rk&ouml;nyvt&aacute;r &quot;C:\&quot; a &quot;documents&quot; k&ouml;nyvt&aacute;r, 
			alatta a &quot;letters&quot; alk&ouml;nyvt&aacute;r, ez alatt a &quot;draft&quot; alk&ouml;nyvt&aacute;r &eacute;s maga a  
			&quot;loveletter.doc&quot; f&aacute;jl. Teh&aacute;t az &uacute;tvonal pontosan &aacute;br&aacute;zolja az el&aacute;gaz&aacute;sokat az ut&oacute;ls&oacute; &aacute;llom&aacute;nyig.
		</p>
	</BODY>
</html>
