<html>
	<head>
		<title>WinDirStat</title>
		<meta name="vs_targetSchema" content="http://schemas.microsoft.com/intellisense/ie5">
		<link rel="stylesheet" type="text/css" href="format.css">
<meta http-equiv="content-type" content="text/html; charset=windows-1250">
	</head>
	<BODY>
		<h1 style="margin-bottom:1pt">WinDirStat - K&ouml;nyvt&aacute;rstatisztika</h1>
		<P style="font-size:70%;margin-top:2pt">Copyright (c) 2003-2005 Bernhard Seifert.
			Permission is granted to copy, distribute and/or modify this document under the 
			terms of the GNU Free Documentation License, Version 1.2 or any later version 
			published by the Free Software Foundation; with no Invariant Sections, no 
			Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included 
			in the section entitled &quot;GNU Free Documentation License&quot;.
		</P>
		<p>Megtekintheti az &ouml;sszes lemez&eacute;nek felhaszn&aacute;lts&aacute;g&aacute;t, &eacute;s seg&iacute;ts&eacute;get kaphat azok kitakar&iacute;t&aacute;s&aacute;hoz.
		</p>
		<p style="color=#006000">Ismerõs &Ouml;nnek a probl&eacute;ma: A merevlemez majdnem tele &eacute;s &Ouml;n nem tudja, hogy mit tegyen,  
			hol tal&aacute;lhat&oacute;k azok a t&eacute;nyleges nagy &aacute;llom&aacute;nyok, amelyek elfoglalj&aacute;k az &ouml;sszes ter&uuml;letet.  
			Azok lehet, hogy rejtve vannak t&ouml;bb al-al-k&ouml;nyvt&aacute;rban. Ezek megkeres&eacute;se a  
			Windows Int&eacute;zõvel f&aacute;rads&aacute;gos: &Ouml;nnek k&ouml;nyvt&aacute;rakat kell kinyitnia &eacute;s bez&aacute;rnia &uacute;jra meg &uacute;jra, hogy megtekinthesse a k&ouml;nyvt&aacute;rak &quot;Tulajdons&aacute;gait&quot;,  
			amelyekben mindig ki kell sz&aacute;molnia az egyes alszerkezetek m&eacute;ret&eacute;t.  
			Ez &iacute;gy kem&eacute;ny munka a lemezhaszn&aacute;lat meg&aacute;llap&iacute;t&aacute;s&aacute;hoz. Ehhez&nbsp;ny&uacute;jt&nbsp;seg&iacute;ts&eacute;get&nbsp;a&nbsp;WinDirStat.
		</p>
		<p>A WinDirStat elind&iacute;t&aacute;sakor a <a href="selectdrivesdialog.htm">Meghajt&oacute; kijel&ouml;l&eacute;se p&aacute;rbesz&eacute;dablak</a> ny&iacute;lik meg. Kattinson az OK gombra.
		</p>
		<p>
			Ekkor a WinDirStat beolvassa a teljes <a href="whatisatree.htm">k&ouml;nyvt&aacute;rszerkezetet</a> 
			egyszer (ez n&eacute;h&aacute;ny pillanatig eltarthat &eacute;s f&uuml;gg a merevlemez m&eacute;ret&eacute;tõl) &eacute;s a szerkezetet hasznos n&eacute;zetekben mutatja be:
		</p>
		<table border="1" bordercolor="#007000" style="BORDER-RIGHT:3px solid; BORDER-TOP:3px solid; BORDER-LEFT:3px solid; WIDTH:373px; BORDER-BOTTOM:3px solid; BORDER-COLLAPSE:collapse; HEIGHT:226px">
			<tr>
				<td colspan="2" style="COLOR:#ffffff; HEIGHT:17px; BACKGROUND-COLOR:#007000">WinDirStat</td>
			</tr>
			<tr style="HEIGHT:80px">
				<td align="center" style="WIDTH: 241px; HEIGHT: 70px"><a href="directorytree.htm">K&ouml;nyvt&aacute;rlista</a></td>
				<td align="center" style="HEIGHT: 70px"><a href="extensionlist.htm">Kiterjeszt&eacute;s lista</a></td>
			</tr>
			<tr style="HEIGHT:100px">
				<td colspan="2" align="center"><a href="treemap.htm">T&eacute;rk&eacute;pfa</a></td>
			</tr>
		</table>
		<p>A n&eacute;zeteket <a href="coupling.htm">&ouml;sszekapcsolhatja</a> egym&aacute;ssal.
		</p>
		<p>&Ouml;n k&eacute;pes a merevlemez&eacute;t sz&aacute;mos m&oacute;don <a href="actions.htm">kitakar&iacute;tani</a>.
		</p>
		<p>A megjelen&iacute;t&eacute;sekben &eacute;s a <a href="userdefinedcleanups.htm">Felhaszn&aacute;l&oacute; &aacute;ltal megadott takar&iacute;t&aacute;sok</a>-ban k&eacute;pes  
			<a href="configuration.htm">be&aacute;ll&iacute;tani</a> a saj&aacute;t ig&eacute;nyei szerint&nbsp;az&nbsp;alkalmaz&aacute;st.
		</p>
		<p><a href="sorting.htm">Rendez&eacute;s</a></p>
		<p><a href="legend.htm">Jelmagyar&aacute;zat</a></p>
		<p><a href="faq.htm">Gyakran Ism&eacute;telt K&eacute;rd&eacute;sek</a></p>
		<p><a href="limits.htm">Korl&aacute;toz&aacute;sok</a></p>
		<p><a href="deinstallation.htm">Elt&aacute;vol&iacute;t&aacute;s</a></p>
		<P style="font-size:70%"><a href="gnufdl.htm">GNU Free Documentation License</a></P>
		<P>&nbsp;</P>
	</BODY>
</html>
